package com.example.shohihadis;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Context;
import android.os.Bundle;

import java.lang.reflect.Array;
import java.util.ArrayList;
import java.util.Arrays;

public class DuyaActivity extends AppCompatActivity {

    ArrayList<String> DuyaNames= new ArrayList<>(Arrays.asList
            ("১। সাইয়িদুল ইস্তিগফার (সাইয়েদুল ইস্তেগফার) বা ক্ষমা প্রার্থনার শ্রেষ্ঠ দো‘আ :\n" +
            "\n" +
            "রাসূলুল্লাহ (ছাঃ) বলেন, ‘যে ব্যক্তি দৃঢ় বিশ্বাসের সাথে এই দো‘আ পাঠ করবে, দিনে পাঠ করে রাতে মারা গেলে কিংবা রাতে পাঠ করে দিনে মারা গেলে, সে জান্নাতী হবে’।\n" +
            "\n" +
            "اَللَّهُمَّ أَنْتَ رَبِّىْ لآ إِلهَ إلاَّ أَنْتَ خَلَقْتَنِىْ وَأَنَا عَبْدُكَ وَأَنَا عَلى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُبِكَ مِنْ شَرِّمَا صَنَعْتُ، أبُوْءُ لَكَ بِنِعْمَتِكَ عَلَىَّ وَأَبُوْءُ بِذَنْبِىْ فَاغْفِرْلِىْ، فَإِنَّهُ لاَيَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ\n" +
            "\n" +
            "উচ্চারণ : আল্লা-হুম্মা আনতা রব্বী লা ইলা-হা ইল্লা আনতা খালাক্বতানী, ওয়া আনা ‘আবদুকা ওয়া আনা ‘আলা ‘আহদিকা ওয়া ওয়া‘দিকা মাসতাত্বা‘তু, আ‘ঊযুবিকা মিন শার্রি মা ছানা‘তু। আবূউ লাকা বিনি‘মাতিকা ‘আলাইয়া ওয়া আবূউ বিযাম্বী ফাগফিরলী ফাইন্নাহূ লা ইয়াগফিরুয্ যুনূবা ইল্লা আনতা।\n" +
            "\n" +
            "অর্থ : ‘হে আল্লাহ! তুমি আমার পালনকর্তা। তুমি ব্যতীত কোন উপাস্য নেই। তুমি আমাকে সৃষ্টি করেছ। আমি তোমার দাস। আমি আমার সাধ্যমত তোমার নিকটে দেওয়া অঙ্গীকারে ও প্রতিশ্রুতিতে দৃঢ় আছি। আমি আমার কৃতকর্মের অনিষ্ট হ’তে তোমার নিকটে আশ্রয় প্রার্থনা করছি। আমি আমার উপরে তোমার দেওয়া অনুগ্রহকে স্বীকার করছি এবং আমি আমার গোনাহের স্বীকৃতি দিচ্ছি। অতএব তুমি আমাকে ক্ষমা কর। কেননা তুমি ব্যতীত পাপসমূহ ক্ষমা করার কেউ নেই’। \n" +
            "\n" +
            "(বুখারী, মিশকাত হা/২৩৩৫ ‘দো‘আ সমূহ’ অধ্যায়-৯, ‘ইস্তিগফার ও তওবা’ অনুচ্ছেদ-৪)",
            "২। ইসমে আজম কি ও ইসমে আজম পাঠের ফজিলত\n" +
                    "\n" +
                    "                                                                              \uD83C\uDF38\uD83C\uDF38\uD83C\uDF38ইসমে আজম কি\uD83C\uDF38\uD83C\uDF38\uD83C\uDF38\n" +
                    "\n" +
                    "\uD83C\uDF3Bইসম’ শব্দের অর্থ নাম আর ‘আজম’ শব্দের অর্থ সবচাইতে মহান বা শ্রেষ্ঠ বা The Greatest.সুতরাং ইসমে আ’যমের অর্থ হচ্ছে “আল্লাহর সবচাইতে মহান বা শ্রেষ্ঠ নাম”। The Greatest Name of Allah. আল্লাহ তাআলার অনেক নাম রয়েছে। এসব নামের মধ্যে যে নামগুলো দিয়েআল্লাহ সুবহানাহু তাআলার বড়ত্ব ও শ্রেষ্ঠত্ব সবচেয়ে বেশি প্রকাশিত হয়,সেই নামগুলোকে ‘ইসমে আজম’ বলা হয়। অর্থাৎ ইসমে আজম অর্থ আল্লাহর নামসমূহের মধ্যে শ্রেষ্ঠ নামগুলো।\n" +
                    "\n" +
                    "★ইসমে আজমের ব্যাপারে বিজ্ঞ আলেমদের থেকে প্রায় ৪০টি মতামত বর্ণিত হয়েছে, যার মধ্যে আল্লামা সুয়ূতি (রহ.) তাঁর রচিত ‘আদ দুররুল মুনাজ্জাম ফিল ইসমিল আজম’ নামক গ্রন্থে ২০টি মতামত উল্লেখ করেছেন।হজরত আবদুল কাদের জিলানি (রহ.) বলেন,”ইসমুল আজম হলো ‘আল্লাহ’ শব্দ। তবে শর্ত হলো তা পূর্ণ একাগ্রতা ও এখলাসের সঙ্গে বলতে হবে’।\n" +
                    "[মিরকাতুল মাফাতিহ: ১/৬]\n" +
                    "\n" +
                    "★মহান আল্লাহ তাআ’লার সুন্দর সুন্দর অনেক নাম রয়েছে,যেমন খালিক্ব, আর-রাহমান,আর-রাহীম ইত্যাদি।একটি সহীহ হাদীসে আল্লাহর নাম ৯৯ টি বলা হলেও,অন্য হাদীসে রয়েছে,এই ৯৯ টি নামের বাইরে আল্লাহর আরো অনেক নাম রয়েছে,যা কোন মানুষকে জানানো হয়নি, অথবা আসলে কেউই জানেনা,এক আল্লাহ ছাড়া।এই সবগুলো নামের মাঝে যেই নাম দিয়ে আল্লাহ সুবহা’নাহু তাআ’লার বড়ত্ব ও শ্রেষ্ঠত্ব সবচাইতে বেশী প্রকাশিত হয়, সেই নামকে ‘ইসমে আযম’ বলা হয়।\n" +
                    "\n" +
                    "★মুহাম্মাদ বিন সালেহ আল-উসায়মিন বলেন,“ইসমে আ’যম হচ্ছে আল-হা’ইয়্যু (চিরঞ্জীব) এবং আল-ক্বাইয়্যুম (চিরস্থায়ী)।আল্লাহ তাআ’লাকে এই বলে দুয়া করা বা আহবান করা,“ইয়া হা’ইয়্যু, ইয়া ক্বাইয়্যুম,ইয়া যাল যালালি ওয়াল ইকরাম” (হে মর্যাদাবান ও কল্যাণময়)। এই দুইটি নাম,আল-হা’ইয়্যু এবং আল-ক্বাইয়্যুম, ক্বুরআনের তিনটি জায়গায় উল্লেখ করা হয়েছে।ইসমে আ’যম রয়েছে আয়াতুল কুরসীর মাঝখানে,“আল্লাহু লা ইলাহা ইল্লা হুওয়াল হা’ইয়্যুল ক্বাইয়্যুম”।\n" +
                    "\n" +
                    "★অর্থঃ আল্লাহ! তিঁনি ছাড়া আর কোন উপাস্য নেই। তিঁনি চিরঞ্জীব,চিরস্থায়ী। ইসমে আ’যম রয়েছে সুরা আলে ইমরানের দ্বিতীয় আয়াতে,“আল্লাহু লা ইলাহা ইল্লা হুওয়াল হা’ইয়্যুল ক্বাইয়্যুম”। এবং সুরা ত্বোয়া-হা, ১১১ নং আয়াত, “সমস্ত মুখমন্ডল সেই চিরঞ্জীব চিরস্থায়ী সত্ত্বার সামনে অবনমিত হবে,আর যে ব্যক্তি জুলুমের বোঝা বহন করবে সে হতাশ হয়ে যাবে।”\n" +
                    "\n" +
                    "★যেই হাদীসের উপর ভিত্তি করে প্রশ্নের উত্তর দেওয়া হয়েছেঃ আবু উমামা রাদিয়াল্লাহু আ’নহু থেকে বর্ণিত। তিনি বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আ’লাইহি ওয়া সাল্লাম বলেছেন,“ক্বুরআনের তিনটি সুরার মাঝে ইসমে আ’যম (আল্লাহর সবচাইতে মহান নাম) রয়েছেঃ আয়াতুল কুরসী, সুরা আলে-ইমরান এবং সুরা ত্বোয়া-হা এর মাঝে।”\n" +
                    "[ইবনে মাজাহঃ ৩৮৫৬,আল-হাকিমঃ ১/৬৮৬,আলবানীর মতে “হাদীসটি হাসান।” সিলসিলাহ আস-সহীহাহঃ ৭৪৬।]\n" +
                    "\n" +
                    "\uD83C\uDF3C\uD83C\uDF3Cইসমে আজমের ফজিলত\uD83C\uDF3C\uD83C\uDF3C\n" +
                    "\n" +
                    "\uD83C\uDF38\uD83C\uDF3Aপ্রিয় ভাই ও বোনেরা আমলের ক্ষেত্রে মাস আলায় অনেক তারতম্য থাকতেই পারে।তাই আমলের ব্যপারে কোন বিতর্ক না করে বরং দেখতে হবে তা কোরআন সুন্নাহ ভিত্তিক কী না! আমাদের জ্ঞানের সীমাবদ্ধতার কারনে আমরা কোন আমল কোরআনে খুঁজে না পেলে দেখতে হবে তা রাসুলের সুন্নাহভিত্তিক ভিত্তিক কী না অর্থাৎ হাদিসের নীতিমালায় আছে কী না? আর কোরআন,হাদিসে না পেলে তা ইজমা কিয়াসে আছে কী না!\n" +
                    "\n" +
                    "প্রিয় ভাই ও বোনেরা ইসলাম একটি পরিপূর্ণ,পূর্ণাঙ্গ, সার্বজনীন ও সর্বকালীন দ্বীন ও ধর্ম।যা সকল যুগে ও সকল সময়ে সর্বশ্রেষ্ঠ,যাতে কোন বিতর্ক এবং না কোন সন্দেহ নেই।কিন্তু আমাদের জ্ঞানের সীমাবদ্ধতার কারনে তা খুঁজে পাইনা বা ধর্মের দোষ দেই।আর একটা সমস্যা হল সমাজের মধ্যে কিছু আধা পাগল নামধারী মৌলুভী আছে যারা কিছু না বুঝেই ফতোয়া দেয়, কথায় কথায় জায়েজ নাই, বিদআত বলে।আরে ভাই ইসলাম কী এত চোট! নাউজুবিল্লাহ! না জানলে জানুন! বুঝুন!তবুও বিভ্রান্তি সৃষ্টি করবেন না!\n" +
                    "\n" +
                    "\uD83C\uDF3A\uD83C\uDF3A\uD83C\uDF3A\uD83C\uDF3A\uD83C\uDF3A\uD83C\uDF3A\uD83C\uDF3A\uD83C\uDF3A\uD83C\uDF3A\uD83C\uDF3A\uD83C\uDF3A\uD83C\uDF3A\n" +
                    "*(ক.) ইসমে আযমের গুরত্ব হচ্ছে,এই নামে বা এই নামের ওসীলা দিয়ে আল্লাহকে ডাকলে বা তাঁর কাছে দুয়া করলে আল্লাহ সবচাইতে বেশি খুশি হন, এবং বান্দার দুয়া কবুল করে নেন।নবী ﷺ এক ব্যক্তিকে নামাযে তাশাহুদ ও দুরুদের পরে সালাম ফিরানোর আগে (দুয়া মাসুরা পড়ার সময়) এই দুয়া পড়তে শুনলেন।নবী ﷺ সাহাবাদেরকে বললেন, তোমরা কি জানো সে কিসের দ্বারা দুয়া করেছে? সাহাবারা বললেন, আল্লাহ ও তাঁর রাসুল ভালো জানেন।তিনি বললেন, সেই মহান সত্ত্বার কসম যার হাতে আঁমার প্রান, নিশ্চয়ই এই ব্যক্তি আল্লাহর নিকট তাঁর “ইসমে আযম” বা সুমহান নামের উসীলায় দুয়া করেছে। “ইসমে আযমের” উসীলায় দুয়া করলে আল্লাহ সেই দুয়া কবুল করে নেন, আর কোনো কিছু চাইলে আল্লাহ তাকে তা দান করেন।\n" +
                    "\n" +
                    "[আবু দাউদ,নাসায়ী,আহমাদ,বুখারীর আল-আদাবুল মুফরাদ,ত্বাবারানী ও ইবনে মান্দাহ “আত-তাওহীদ” গ্রন্থে (৪৪/২, ৬৭/১, ৭০/১-২)]\n" +
                    "\n" +
                    "★একাধিক সহীহ হাদীসে এসেছে।\n" +
                    "\n" +
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَوَاتِ وَالْأَرْضِ يَا ذَا الْجَلاَلِ وَالْإِكرَامِ، يَا حَيُّ يَا قَيُّومُ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ\n" +
                    "\n" +
                    "উচ্চারণঃ আল্লা-হুম্মা ইন্নী আস-আলুকা বি-আন্না লাকাল হা’মদু লা-ইলা-হা ইল্লা-আনতা ওয়াহ’দাকা লা-শারীকা লাকাল মান্না-ন, ইয়া বাদীআ’স্ সামা-ওয়া-তি ওয়াল-আরদ্বি, ইয়া যাল জালা-লি ওয়াল-ইকরা-ম। ইয়া হা’ইয়্যু ইয়া ক্বাইয়্যুম, ইন্নী আসআলুকাল্ জান্নাতা ওয়া আউ’যু বিকা মিনান্না-র।\n" +
                    "\n" +
                    "অর্থঃ হে আল্লাহ! আমি আঁপনার কাছে প্রার্থনা করি কারন,সকল প্রশংসা আপনার জন্য,কেবলমাত্র আঁপনি ছাড়া আর কোনো সত্য ইলাহ নেই,আঁপনার কোনো শরীক নেই,আঁপনি সীমাহীন অনুগ্রহকারী। হে আসমানসমূহ ও যমীনের অভিনব স্রষ্টা! হে মহিমাময় ও মহানুভব! হে চিরঞ্জীব, হে চিরস্থায়ী-সর্বসত্ত্বার ধারক! আমি আঁপনার কাছে জান্নাত চাই এবং জাহান্নাম থেকে আশ্রয় চাই।\n" +
                    "\n" +
                    "\uD83C\uDF37সুতরাং, ইসমে আযমের মাঝে রয়েছে…\n" +
                    "\n" +
                    "لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَوَاتِ وَالْأَرْضِ يَا ذَا الْجَلاَلِ وَالْإِكرَامِ، يَا حَيُّ يَا قَيُّومُ\n" +
                    "\n" +
                    "“লা-ইলা-হা ইল্লা-আনতা ওয়াহ’দাকা লা-শারীকা লাকাল মান্না-ন, ইয়া বাদীআ’স্ সামা-ওয়া-তি ওয়াল-আরদ্বি, ইয়া যাল জালা-লি ওয়াল-ইকরা-ম। ইয়া হা’ইয়্যু ইয়া ক্বাইয়্যুম”।\n" +
                    "\n" +
                    "***মুনাজাতের মাঝে উপরের ইসমে আজমের দুয়া পড়ে এর পরে নিজের ইচ্ছামতো যেকোন দুয়া করবেন।\n" +
                    "\n" +
                    "★ ইসমে আজমের এই দুয়াটা আপনারা হিসনুল মুসলিম বইয়ের সালাম ফেরানোর পূর্বে পঠিত দুয়া অধ্যায়ের ১০০-১০১ পৃষ্ঠায় পাবেন।\n" +
                    "\n" +
                    "“আল্লা-হুম্মা ইন্নী আস-আলুকা বি-আন্না লাকাল হা’মদু লা-ইলা-হা ইল্লা-আনতা ওয়াহ’দাকা লা-শারীকা লাকাল মান্না-ন, ইয়া বাদীআ’স্ সামা-ওয়া-তি ওয়াল-আরদ্বি, ইয়া যাল জালা-লি ওয়াল-ইকরা-ম। ইয়া হা’ইয়্যু ইয়া ক্বাইয়্যুম”…\n" +
                    "\n" +
                    "এই পর্যন্ত পড়ে,পরে দুনিয়া বা আখেরাতের জন্য কল্যানকর এমন যেকোন দুয়া করা যাবে। পরের অংশটুকু “ইন্নী আসআলুকাল্”…অর্থ হচ্ছে – নিশ্চয়ই আমি আপনার (আল্লাহর) কাছে প্রার্থনা করিতেছি যে…জান্নাতা ওয়া আউ’যু বিকা মিনান্না-র – জান্নাত ও জাহান্নাম হতে আশ্রয় হতে প্রার্থনা করিতেছি।\n" +
                    "\n" +
                    "কেউ জান্নাত ও জাহান্নামের পরিবর্তে অন্য দুয়াও করতে পারে। যেমন সে এইভাবে বলতে পারবেঃ\n" +
                    "\n" +
                    "………ইয়া হা’ইয়্যু ইয়া ক্বাইয়্যুম…আল্লা-হুম্মা ইন্নি আস-আলুকাল হুদা ওয়াত-তুকা ওয়াল আ’ফাফা ওয়াল গি’না।\n" +
                    "اَللهم إِنِّي أَسْأَلُكَ الهُدَى، وَالتُّقَى، وَالعَفَافَ، وَالغِنَى\n" +
                    "অর্থ: হে আল্লাহ আমি তোমার কাছে হেদায়েত, তাকওয়া, সুস্থতা ও সম্পদ প্রার্থনা করছি।\n" +
                    "[মুসলিম: ২৭২১,তিরমিযী: ৩৪৮৯,ইবনু মাজাহ: ৩৮৩২,আহমাদ: ৩৬৮৪]\n" +
                    "\n" +
                    "[সবার প্রতি অনুরোধ রইল ২য় অংশটুকু দেখার নতুবা আপনার কাছে বিভ্রান্তি লাগতে পারে এজন্য ২য় অংশটুকু বা শেষ পর্ব দেখবেন।আগামীকাল ইন-শা-আল্লাহ বাকি পর্ব দেওয়া হবে।সাথেই থাকুন।সবাই সবার সুসাস্থ্য কামনা করে আল্লাহর নিকট বেশী বেশী দোয়া করবেন।]\n" +
                    "\n" +
                    "\uD83C\uDF37ইসমে আজম কি ও ইসমে আজম পাঠের ফজিলত -২য় পর্ব\n" +
                    "\n" +
                    "*(খ.) হজরত আনাস (রা:) থেকে বর্ণিত, এক সাহাবী রাসূলুল্লাহ ﷺ-এঁর উপস্থিতিতে নিম্নোক্ত শব্দমালার মাধ্যমে দোয়া করেছিলেন-\n" +
                    "\n" +
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ، لاَ إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لك الْمَنَّانُ بَدِيعَ السَّمَوَاتِ وَالأَرْضِ، يَا ذَا الْجَلالِ وَالإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ\n" +
                    "\n" +
                    "অর্থাৎ, হে আল্লাহ! আঁপনার নিকট এই অসীলায় চাই যে,(আমি বলি) কেবল আপনারই প্ৰশংসা, আপনি ব্যতীত প্রকৃত কোন উপাস্য নেই,আপনি এক,আপনার কোন শরীক নেই, অনুগ্রহ প্রদর্শনকারী হে আসমানসমূহ ও জমিনের সৃষ্টিকর্তা, হে মর্যাদা ও সম্মান দানের অধিকারী। হে চিরঞ্জীব ও সর্বনিয়ন্তা।\n" +
                    "\n" +
                    "★ওই সময় রাসূলুল্লাহ ﷺ বলেছিলেন-\n" +
                    "\n" +
                    "لَقَدْ دَعَا اللَّهَ بِاسْمِهِ الْعَظِيمِ الَّذِي إِذَا دُعِيَ بِهِ أَجَابَ وَإِذَا سُئِلَ بِهِ أَعْطَى\n" +
                    "\n" +
                    "এই লোক মহান আল্লাহর ওই ইসমে আ’যমের মাধ্যমে দোয়া করেছে যার মাধ্যমে দোয়া করা হলে আল্লাহ কবুল করেন এবং প্রার্থনা করা হলে তিনি তা দান করেন।\n" +
                    "[আবু দাউদ ১৪৯৫ তিরমিযী ৩৫৪৪ নাসাঈ ১৩০০]\n" +
                    "\n" +
                    "\uD83C\uDF3Bআবার এভাবেও বর্ননায় পাওয়া যায় হজরত আনাস (রা.) সূত্রে বর্ণিত : একবার রাসুল ﷺ মসজিদে প্রবেশ করেছেন।এমতাবস্থায় এক লোক নামাজ শেষে এ দোয়া করছিলেন, ‘আল্লাহুম্মা লা-ইলাহা ইল্লা আংতার মান্নাম, বাদিয়ুস সামাওয়াতি ওয়াল আরদি ইয়া জাল জালালি ওয়াল ইকরাম।’ তখন রাসুল ﷺ তাঁকে বললেন, ”তুমি জানো, তুমি কি দিয়ে দোয়া করেছ? তুমি দোয়া করেছ ‘ইসমে আজম’ দিয়ে,যা দ্বারা দোয়া করলে আল্লাহ কবুল করেন এবং তা দ্বারা কিছু চাইলে আল্লাহ তা প্রদান করেন।”\n" +
                    "[সুনানে তিরমিজি : ৩৫৪৪]\n" +
                    "\n" +
                    "*(গ.) হজরত আনাস ইবনে মালেক (রা.) থেকে বর্ণিত, একদিন রাসুল ﷺ নামাজের পর দোয়ারত জায়েদ ইবনে সামেত (রা.)-এর পাশ দিয়ে যাচ্ছিলেন।দোয়াতে তিনি বলছিলেন,’আল্লাহুম্মা ইন্নি আস-আলুকা বি-আন্না লাকাল হা’মদু লা-ইলা-হা ইল্লা-আনতা ওয়াহ’দাকা লা-শারিকা লাকাল মান্না-ন, ইয়া বাদিআ’স্ সামা-ওয়া-তি ওয়াল আরদ্বি, ইয়া জাল জালালি ওয়াল ইকরাম। ইয়া হাইয়্যু ইয়া কাইয়্যুম।’ তখন রাসুল ﷺ\n" +
                    "তাঁকে বললেন, ‘তুমি আল্লাহর দরবারে ইসমে আজমের মাধ্যমে দোয়া করেছ, যার মাধ্যমে দোয়া করলে আল্লাহ তাআলা কবুল করেন এবং কিছু চাইলে তা দান করেন।’\n" +
                    "[মুসনাদে আহমদ : ১২২০৫]\n" +
                    "\n" +
                    "*(ঘ.) হজরত আবু উমামা (রা:) থেকে বর্ণিত,রাসূলুল্লাহ ﷺ বলেছেন,\n" +
                    "\n" +
                    "اسْمُ اللَّهِ الأَعظَمُ فِي سُوَرٍ مِنَ القُرآنِ ثَلَاثٍ : فِي ” البَقَرَةِ وَ آلِ عِمرَانَ وَ طَه\n" +
                    "আল্লাহর ইসমে আ’যম কোরআনের তিনটি সূরা-বাকারা,আল ইমরান ও ত্বহার মধ্যে রয়েছে।\n" +
                    "[ইবন মাজাহ: ৩৮৫৬]\n" +
                    "\n" +
                    "*(ঙ.) হজরত বুরাইদাহ ইবন হুসাইব (রা:) থেকে বর্ণিত,রাসূলুল্লাহ ﷺ এক সাহাবীকে বলতে শুনেছেন,\n" +
                    "\n" +
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ\n" +
                    "অর্থাৎ, হে আল্লাহ! নিশ্চয় আমি আপনার নিকট চাচ্ছি। নিশ্চয় আমি সাক্ষ্য দিচ্ছি, আপনিই আল্লাহ। আপনি ছাড়া কোনো উপাস্য নেই, যিনি একক, অমুখাপেক্ষী যিনি কাউকে জন্ম দেন নি, তার থেকে কেউ জন্ম নেন নি এবং তাঁর সমকক্ষ কেউ নেই।\n" +
                    "\n" +
                    "★ওই সময় রাসূলুল্লাহ ﷺ বলেছিলেন-\n" +
                    "\n" +
                    "لَقَدْ سَأَلْتَ اللَّهَ بِالِاسْمِ الَّذِي إِذَا سُئِلَ بِهِ أَعْطَى وَإِذَا دُعِيَ بِهِ أَجَابَ\n" +
                    "তুমি আল্লাহর ওই নাম নিয়ে দোয়া করেছ, যার মাধ্যমে প্রার্থনা করা হলে তিনি তা দান করেন এবং দোয়া করা হলে কবুল করেন।\n" +
                    "[আবু দাউদ: ১৪৯৩ তিরমিযী ৩৪৭৫ ইবন মাজাহ ৩৮৫৭]\n" +
                    "\n" +
                    "*(চ.) আসমা বিনত ইয়াযিদ (রা:) থেকে বর্ণিত, রাসূলুল্লাহ ﷺ বলেছেন,আল্লাহর ইসমে আ’যম নিম্নোক্ত দু’টি আয়াতে রয়েছে-\n" +
                    "وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ لَا إِلَهَ إِلَّا هُوَ الرَّحْمَنُ الرَّحِيمُ\n" +
                    "\n" +
                    "সুরা বাকারার ৩৬১ নম্বর আয়াত এবং সুরা আল ইমরানের ১ নম্বর আয়াত।’\n" +
                    "\n" +
                    "الم . اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ\n" +
                    "\n" +
                    "[আবু দাউদ ১৪৯৬ তিরমিযী ৩৪৭৮ ইবন মাজাহ ৩৮৫৫]\n" +
                    "\n" +
                    "*(ছ.) হজরত বুরাইদা (রা.) থেকে বর্ণিত, রাসুল ﷺ দুজন লোককে এটা বলতে শুনেছেন যে ‘আল্লাহুম্মা ইন্নি আস আলুকা,বিআন্নি আশহাদু আন্নাকা আংতাল্লাহ,লা-ইলাহা ইল্লা আংতাল আহাদুস সামাদ,আল্লাজি লাম ইয়ালিদ ওয়া লাম ইউলাদ ওয়ালাম ইয়া কুল্লাহু কুফুওয়ান আহাদ।’ তখন রাসুল ﷺ বলেন, ‘তোমরা আল্লাহর কাছে ইসমে আজমের মাধ্যমে চেয়েছ, যার মাধ্যমে চাইলে আল্লাহ দান করেন এবং দোয়া করলে আল্লাহ কবুল করেন।’\n" +
                    "[আবু দাউদ : ১৪৯৩]\n" +
                    "\n" +
                    "★হাফেজ ইবনে হাজার আসকালানি (রহ.) বলেন, ‘ইসমে আজমের ব্যাপারে বর্ণিত হাদিসগুলোর মধ্যে এটি সবচেয়ে বিশুদ্ধ।’\n" +
                    "[তুহফাতুজ জাকিরিন: ১/৮২]\n" +
                    "\n" +
                    "*(জ.) হজরত ইবনে আবি হাতিম (রহ:) হজরত কাসির ইবেন সা’দ থেকে নকল করেন,তিনি বলেন,আমি হাসান বসরি (রহ:) কে জিজ্ঞাসা করলাম যে,আল্লাহর ইসমে আযম কোনটি,যে নামের দ্বারা দোয়া করলে দোয়া কবূল হয় এবং কোনো কিছু চাইলে তা দেয়া হয়?\n" +
                    "\n" +
                    "উত্তরে তিনি বললেন, ভাতুষপুত্র! তুমি কি আল্লাহর এই বানীটি পড়নি? অতপর তিনি এই আয়াত দুটি তেলাওয়াত করে বললেন, এটাই হলো সে ইসমে আযম, যার দ্বারা দোয়া করলে দোয়া কবূল হয় এবং কোনো কিছু চাওয়া হলে তা দেয়া হয়।\n" +
                    "[তাফসিরে ইবনে কাসির:৩/৩৯৫-৩৯৬]\n" +
                    "\n" +
                    "\uD83C\uDF37আরেকটি হাদিসে এসেছে,কোনো মুসলমান যদি অসুস্থ অবস্থায় এ আয়াতটি চল্লিশ বার পড়ে তাহলে ওই অসুখে সে মারা গেলে চল্লিশজন শহিদের সওয়াব পাবে। আর সুস্থ হয়ে গেলে তার যাবতীয় গোনাহ মাফ করে দেয়া হবে। [হিসনে হাসিন-২৪১]\n" +
                    "\n" +
                    "*(ঝ.) কোনো কোনো সাহাবী থেকে থেকে বর্ণিত আছে, الْحَيُّ এবং الْقَيُّومُ আল্লাহর ইসমে আ’যম। ইমাম রাযী (রহ:) ও আল্লামা নববী (রহ:) এ মতকেই গ্রহণ করেছেন। [ফাতাওয়া উসমানী: ১/২৬৪]\n" +
                    "\n" +
                    "*(ঞ.) ইমাম মুহাম্মদ (রহ:) বলেন,আমি ইমাম আবু হানিফা (রহ:) থেকে শুনেছি, আল্লাহ তাআলার ইসমে আ’যম হল, اللَّه (আল্লাহ)।\n" +
                    "[আত-তাকরীর ওয়াত-তাহবীর: ১/৫]\n" +
                    "\n" +
                    "★কেননা,এটি তাঁর সত্তাগত নাম।তাছাড়া কোরআন মজিদে এই নামটিই ২৬৯৭ বার এসেছে।এত বেশি তাঁর অন্য নাম আসে নি।\n" +
                    "\n" +
                    "*(ট.) আল্লামা জাযারী (রহ:) বলেছেন, আমার মতে ইসমে আ’যম হল,\n" +
                    "لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ\n" +
                    "তবে কারো কারো মতে رب শব্দটি এবং অনেকের মতে اللَّه শব্দটি ইসমে আ’যম। (প্রাগুক্ত)\n" +
                    "\n" +
                    "*(ঠ.) কেউ কেউ কলেছেন,\n" +
                    "استأثر الله تعالى بعلم الاسم الأعظم ولم يطلع عليه أحداً من خلقه\n" +
                    "ইসমে আ’যম একটি রহস্য।আল্লাহ কাউকে জানান নাই।\n" +
                    "[ফাতহুল বারী: ১১/২২৪]\n" +
                    "\n" +
                    "\uD83D\uDC8Eতবে এক্ষেত্রে মুহাক্কিক আলেমগণের বক্তব্য হলো,প্রকৃত পক্ষে আল্লাহ তা’আলার সকল নামই আ’যীম তথা মহিমান্বিত।কোনো নামের উপর কোনো নামের আলাদা ফযিলত-মর্যাদা নেই। সুতরাং ইসমে-আ’যম তথা আল্লাহ তা’আলার সকল নামের মধ্যে সবচেয়ে সম্মানিত কোনটি; এরূপ কোনো বিষয় নির্দিষ্টভাবে নির্ভরযোগ্য বর্ণনা দ্বারা প্রমাণিত নয়।যে সব নামকে হাদীস শরীফে ‘ইসমে-আ’যম’ বলা হয়েছে- এর দ্বারা উদ্দেশ্য হলো, এই নামগুলো আল্লাহ তা’আলার আ’যীম (মহান) নামের মধ্য থেকে।বিশেষভাবে এই নামগুলোর মাধ্যমে দোয়া কবুল হয়।এ কারণেই ইসমে-আ’যম সম্পর্কে একাধিক বর্ণনা পাওয়া যায়। সুতরাং নিশ্চিত ও সর্ব সম্মতভাবে কোনো একটি নামকে ‘ইসমে-আ’যম’ হিসাবে আখ্যা দেয়া সুকঠিন বৈ কি!\n" +
                    "[ফাতাওয়া উসমানী ১/২৬৪,২৬৫]\n" +
                    "\n" +
                    "\uD83C\uDF37ফাতাওয়াল লাজনাতিদ্দায়িমা (২/ ৪১৩)-তে এসেছে,\n" +
                    "\n" +
                    "قال الله تعالى: (وَلِلَّهِ الْأَسْمَاءُ الْحُسْنَى فَادْعُوهُ بِهَا وَذَرُوا الَّذِينَ يُلْحِدُونَ فِي أَسْمَائِهِ سَيُجْزَوْنَ مَا كَانُوا يَعْمَلُونَ) ، وقال النبي ﷺ : (إن لله تسعة وتسعين اسما من أحصاها دخل الجنة) ، ومنها الاسم الأعظم الذي إذا دعي به أجاب، وإذا سئل به أعطى، فأسماء الله جل وعلا لا يعلم عددها إلا هو، وكلها حسنى\n" +
                    "\n" +
                    "আল্লাহ তাআলা বলেছেন, ‘আর আল্লাহর জন্য রয়েছে সব উত্তম নাম। কাজেই সে নাম ধরেই তাঁকে ডাক। আর তাদেরকে বর্জন কর, যারা তাঁর নামের ব্যাপারে বাঁকা পথে চলে।তারা নিজেদের কৃতকর্মের ফল শীঘ্রই পাবে।’ রাসূলুল্লাহ ﷺ বলেছেন,আল্লাহ্ তাআলার নিরানববইটি নাম আছে।যে ব্যক্তি এগুলো মুখস্থ করে রাখবে সে জান্নাতে প্রবেশ করবে।’এ নামগুলোর মধ্যে ইসমে আ’যম রয়েছে,যার মাধ্যমে দোয়া করা হলে আল্লাহ কবুল করেন এবং প্রার্থনা করা হলে তিনি তা দান করেন। আল্লাহর নামগুলোর সংখ্যা একমাত্র তিনি জানেন। আর তাঁর প্রতিটি নাম উত্তম।\n" +
                    "\uD83C\uDF30\uD83C\uDF30\n" +
                    "আবার আরেকটি মতামত অনুযায়ী আয়াতুল কুরসীতে রয়েছে ইসমে আজম।আল্লাহ তায়ালার সুন্দর সুন্দর নাম রয়েছে,আর আমাদেরকে সে নামগুলোর মাধ্যমে তাকে ডাকার নির্দেশ দেয়া হয়েছে।সে বরকতময় নামগুলোর মাঝে রয়েছে ইসমে আজম; যে নামের মাধ্যমে (অসীলায়) চাইলে দেয়া হয়, এবং তার মাধ্যমে প্রার্থনা করলে গ্রহণ করা হয়।\n" +
                    "\n" +
                    "★এ সম্পর্কে ইমাম আহমাদ,আসমা বিনতে ইয়াযীদ (রা:) হতে বর্ণনা করেন, তিনি বলেন,আমি রাসূলুল্লাহ ﷺ কে বলতে শুনেছি;\n" +
                    "اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ\n" +
                    "অর্থাৎ “আল্লাহ, তিনি ব্যতীত কোন সত্যিকার মা’বূদ নেই। তিনি চিরঞ্জীব, চিরপরিচালক।[সূরা বাক্বারা ২৫৫]\n" +
                    "\n" +
                    "এবং ألم اللّهُ لا إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّوم\n" +
                    "\n" +
                    "“আলিফ, লাম, মীম, আল্লাহ, তিনি ব্যতীত কোন সত্যিকার মা’বূদ নেই। তিনি চিরঞ্জীব, চিরপরিচালক।\n" +
                    "[সূরা আলে ইমরান ১-২]\n" +
                    "\n" +
                    "★এ আয়াত দুটিতে এসমে আজম রয়েছে।★\n" +
                    "[মুসনাদে ইমাম আহমদ এর তারতীব আল ফাতহুর রাব্বানী, কুরআনের ফযীলত ও তার তাফসীর ও অবতীর্ণের পটভুমি অধ্যায়, আয়াতুল কুরসীর ফযীলত পরিচ্ছেদ, হাদীস নং ১৯৬, ১৮/৯২]\n" +
                    "\n" +
                    "★শায়খ আহমাদ আব্দুর রহমান আল বান্না বলেন: এ থেকে জানা গেল যে, এসমে আজম হলো:\n" +
                    "اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ\n" +
                    "\n" +
                    "এ সম্পর্কে আল্লাহই অধিক অবগত। দেখন: [বুলুগুল আমানী ১৮/৯২]\n" +
                    "\n" +
                    "এবং ইমাম হাকেম,আল-কাসেম বিন আব্দুর রহমান হতে, তিনি আবু উমামা হতে, তিনি নবী ﷺ হতে বর্ণনা করেন, তিনি বলেন: ইসমে আজম তিনটি সূরাতে রয়েছে; সূরা বাক্বারায়,সূরা আলে ইমরানে ও সূরায়ে ত্বাহা-তে। তিনি বলেন (অর্থাৎ হাদীসের বর্ণনাকারী আল-কাসেম বিন আব্দুর রহমান।\n" +
                    "[কথিত আলবানী এর সহীহ হাদীস সিরিজ: ২/৩৮৩]\n" +
                    "\n" +
                    "★তা আমি সূরা বাক্বারাতে পেয়েছি, আর তা হলো আয়াতুল কুরসী:\n" +
                    "\n" +
                    "اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ\n" +
                    "\n" +
                    "অর্থাৎ “আল্লাহ, তিনি ব্যতীত কোন সত্যিকার মা’বূদ নেই। তিনি চিরঞ্জীব, চিরপরিচালক।\n" +
                    "[সূরা বাক্বারা ২৫৫]\n" +
                    "\n" +
                    "এবং সূরায়ে আলে ইমরানে পেয়েছি:\n" +
                    "ألم اللّهُ لا إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ “\n" +
                    "\n" +
                    "আলিফ, লাম, মীম। আল্লাহ, তিনি ব্যতীত কোন সত্যিকার মা’বূদ নেই। তিনি চিরঞ্জীব, চিরপরিচালক।\n" +
                    "[সূরা আলে ইমরান ১-২]\n" +
                    "\n" +
                    "এবং সূরা ত্বাহাতে পেয়েছি:\n" +
                    "وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ\n" +
                    "\n" +
                    "অর্থাৎ চিরঞ্জীব চিরস্থায়ীর সম্মুখে সকলেই হবে অধোমুখী।\n" +
                    "[সূরা ত্বাহা: ১১১,আলমুসতাদরাক আলা সহীহায়ন, প্রার্থনা অধ্যায় ১/৫০৬।]\n" +
                    "\n" +
                    "অতএব, যে ব্যক্তি ইসমে আজমের মাধ্যমে প্রার্থনা করবে,তার প্রার্থনা কবুল করা হবে।সুতরাং আয়াতুল কুরসীতে যা বর্ণিত হয়েছে, তার মাধ্যমে যেন সে দোয়া প্রার্থনা করে:\n" +
                    "اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ\n" +
                    "\n" +
                    "অর্থাৎ “আল্লাহ, তিনি ব্যতীত কোন সত্যিকার মা’বূদ নেই। তিনি চিরঞ্জীব, চিরপরিচালক।\n" +
                    "[সূরা বাক্বারা,আয়াত নং ২৫৫]\n" +
                    "\n" +
                    "★ ইবনে তাইমিয়্যাহ এর মতে: ইসমে আজম হলো (الحي) আল-হাইয়্যূ। এ সম্পর্কে তিনি বলেন: আল-হাইয়্যূতে সকল গুণগুলো বিরাজমান, এবং এটাই হল তার মূল। এ কারণেই কুরআনের মধ্যে সর্বাপেক্ষা সম্মানিত আয়াত হলো:\n" +
                    "\n" +
                    "اللّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ) سورة البقرة(\n" +
                    "\n" +
                    "অর্থাৎ “আল্লাহ, তিনি ব্যতীত কোন সত্যিকার মা’বূদ নেই। তিনি চিরঞ্জীব, চিরপরিচালক। এটাই হলো এসমে আজম। কেননা প্রত্যেক সৃষ্টিজীবই হায়াত কামনা করে। এজন্যই তা সকল গুণ সম্বলিত। যদি সকল গুণ একটি গুণ দ্বারা প্রকাশ করা হত, তবে আল-হাইয়ূ দ্বারা প্রকাশ করাই যথেষ্ট হত।\n" +
                    "[মাজমূউ ফাতাওয়া ১৮/৩১১]\n" +
                    "\n" +
                    "★ইবনে কাইয়্যূম আল-জাউযীয়াহ এর মতে: ইসমে আজম হলো: আল-হাইয়্যূল কায়্যূম। তিনি বলেন: এসমে আজম আল্লাহ তায়ালার এমন নাম; যার উসিলায় প্রার্থনা করা হলে, কবূল করেন এবং সে নামের অসীলায় চাওয়া হলে দেয়া হয়। আর তা হলো: আল-হাইয়্যূল কাইয়্যূম।\n" +
                    "[যাদুল মায়াদ: ৩/১৩০]",
            "৩। আজান ও ইকামত :\n" +
                    "\n" +
                    "                                                                \uD83C\uDF38\uD83C\uDF38\uD83C\uDF38আজান ও ইক্বামতের সময় দোয়ার ফজিলত\uD83C\uDF38\uD83C\uDF38\uD83C\uDF38\n" +
                    "\n" +
                    "দোয়া হলো ইবাদত। আল্লাহ তাআলা বলেন, ‘তুমি আল্লাহ ব্যতীত এমন কারো ইবাদত করো না, যে তোমার ভালো-মন্দ কিছুই করতে পারে না।’ (সুরা ইউনুস : আয়াত ১০৬)\n" +
                    "\n" +
                    "মানুষের প্রয়োজন পূরণে আল্লাহ তাআলার সমীপে দোয়া করতে হবে। আল্লাহ তাআলা মানুষকে তাঁর কাছে চাওয়ার জন্য নির্দেশ প্রদান করেন বলেন, ‘তোমরা আমাকে ডাক, আমি তোমাদের ডাকে সাড়া দিব। (সুরা মুমিন : আয়াত ৬০)\n" +
                    "\n" +
                    "আল্লাহ তাআলার কাছে দোয়া করার কিছু সময় ও স্থান রয়েছে। যে সময় ও স্থানে দোয়া করলে আল্লাহ তাআলা বান্দার সব চাওয়া পাওয়া কবুল করেন।\n" +
                    "\n" +
                    "আজান ও ইক্বামতের মাঝে দোয়া, আজান চলাকালীন সময়ে এবং আজানের পর দোয়া করলে আল্লাহ তাআলা বান্দার সে দোয়া ফিরিয়ে দেন না। এ সময় দোয়া কবুলের বিষয়টি অনেক হাদিসে বর্ণিত হয়েছে।\n" +
                    "\n" +
                    "হজরত আনাস ইবনে মালেক রাদিয়াল্লাহু আনহু বলেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, ‘আজান এবং ইক্বামতের মাঝের দোয়া ফেরত দেয়া হয় না। (মুসনাদে আহমদ, আবু দাউদ, মিশকাত)\n" +
                    "\n" +
                    "হজরত আবদুল্লাহ ইবনে আমর রাদিয়াল্লাহু আনহু বলেন, এক ব্যক্তি বলল, হে আল্লাহর রাসুল! (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম) মুয়াজ্জিনের মর্যাদা যে আমাদের চেয়ে বেশি হয়ে যাবে, তখন রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেন, ‘তুমিও তাই বল, মুয়াজ্জিন যা বলে। তারপর আজান শেষ হলে (আল্লাহর কাছে) চাও, যা চাইবে (তাই) প্রদান করা হবে। (আবু দাউদ, মিশকাত)\n" +
                    "\n" +
                    "অন্য এক বর্ণনায় এসেছে, ‘মুয়াজ্জিনের সঙ্গে সঙ্গে আজানের শব্দগুলো যে বলবে, সে জান্নাতে যাবে। (মুসলিম, আবু দাউদ, মিশকাত)\n" +
                    "\n" +
                    "অপর এক বর্ণনায় রয়েছে, যে ব্যক্তি আজান শুনে বলবে-\n" +
                    "\n" +
                    "উচ্চারণ\n" +
                    "আশহাদু আল্লা- ইলা-হা ইল্লাল্লাহু ওয়াহদাহু লা- শারিকা লাহু। ওয়া আশহাদু আন্না মুহাম্মাদান আ’বদুহু ওয়া রাসুলুহ; রাদিতুবিল্লা-হি রাব্বাওঁ ওয়া ওয়া বিমুহাম্মাদির রাসুলাওঁ ওয়া বিল ইসলামি দ্বীনা।\n" +
                    "\n" +
                    "অর্থ\n" +
                    "‘আমি সাক্ষ্য দিচ্ছি যে, এক আল্লাহ ব্যতীত (ইবাদতের উপযুক্ত) কোনো উপাস্য নেই এবং তাঁর কোনো শরিক নেই। আমি আরো সাক্ষ্য দিচ্ছি যে, মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম তাঁর বান্দা ও রাসুল। আমি আল্লাহকে রব হিসাবে, মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম)কে রাসুল হিসাবে এবং ইসলামকে দ্বীন হিসাবে মেনে নিয়েছি।’\n" +
                    "\n" +
                    "তাহলে তার পাপসমূহ ক্ষমা করা হবে। (মুসলিম আবু দাউদ, মিশকাত)\n" +
                    "\n" +
                    "পরিশেষে...\n" +
                    "দোয়া হলো আল্লাহ তাআলার শ্রেষ্ঠ ইবাদত। কারণ দোয়া প্রার্থনার সময় বান্দা আল্লাহর নিকট সবচেয়ে বেশি ছোট হয়ে কাকুতি-মিনতি করে ক্ষমা প্রার্থনা করে। ছোট হয়ে প্রয়োজনীয় জিনিসগুলো চায়। যেখানে সাধারণ শিরকের কোনো সম্ভাবনা থাকে না।\n" +
                    "\n" +
                    "আর আজান ও ইক্বামতের সময় দোয়া করার নির্দেশ দিয়েছেন স্বয়ং বিশ্বনবি সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম। এ সময় দোয়া করার ফজিলতও অনেক বেশি। তাই মানুষের প্রার্থনা কবুলে আজান ও ইক্বামতের সময়ের দোয়ার ব্যাপারে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের হাদিসের আমল করা জরুরি।\n" +
                    "\n" +
                    "আল্লাহ তাআলা মুসলিম উম্মাহকে প্রয়োজন পূরণে ক্ষমা লাভে আজান ও ইক্বামতের সময়ে প্রার্থনা করার তাওফিক দান করুন।",
                    "৪। رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا\n" +
                            "\n" +
                            "আরবী উচ্চারণ: রাব্বানা হাবলানা মিন আযওয়াজিনা ওয়া যুররিইয়াতিনা কুররাতা আইইনিও ওয়াজ আলনা লিল মুত্তাক্বিনা ইমামা।\n" +
                            "\n" +
                            "বাংলা অর্থ: হে আমাদের রব ! আমাদের নিজেদের স্ত্রীদের ও নিজেদের সন্তানদেরকে নয়ন শীতলকারী বানাও এবং আমাদের করে দাও মুত্তাকীদের ইমাম। (আল ফুরকান:৭৪)",
                    "৫। رَبَّنَاۤ اٰتِنَا مِنۡ لَّدُنۡکَ رَحۡمَۃً وَّ ہَیِّیٴۡ لَنَا مِنۡ اَمۡرِنَا رَشَدًا\n" +
                            "\n" +
                            " আরবী উচ্চারণ: রাব্বানা আতিনা মিল্লাদুনকা রাহমাতাঁও ওয়া হাইয়ি' লানা মিন আমরিনা রাশাদ।\n" +
                            "\n" +
                            "বাংলা অর্থ: হে আমাদের রব! তোমার বিশেষ রহমতের ধারায় আমাদের প্লাবিত করো এবং আমাদের ব্যাপার ঠিকঠাক করে দাও। (কাহাফ:১০)",
                    "৬। رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ\n" +
                            "\n" +
                            " আরবী উচ্চারণ: রাব্বানাফ তাহ বাইনানা ওয়া বাইনা ক্বাউমিনা বিল হাক্বক্বি ওয়া আনতা খাইরুল ফাতিহীন।\n" +
                            "\n" +
                            "বাংলা অর্থ: হে আমাদের রব! আমাদের ও আমাদের সম্প্রদায়ের মধ্যে যথাযথভাবে ফায়সালা করে দাও এবং তুমি সবচেয়ে ভালো ফায়সালাকারী। (আল আরাফ:৮৯)",
                    "৭। رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ\n" +
                            "\n" +
                            "আরবী উচ্চারণ: রাব্বানা লাতুযিগ কুলুবানা বাদা ইয হাদাইতানা ওয়া হাবলানা মিল্লাদুনকা রাহমাতান, ইন্নাকা আনতাল ওয়াহাব।\n" +
                            "\n" +
                            "বাংলা অর্থ: হে আমাদের রব! যখন তুমি আমাদের সোজা পথে চালিয়েছো তখন আর আমাদের অন্তরকে বক্রতায় আচ্ছন্ন করে দিয়ো না, তোমার দান ভাণ্ডার থেকে আমাদের জন্য রহমত দান করো কেননা তুমিই আসল দাতা। (আল ইমরান:০৮)",
                    "৮। رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ\n" +
                            "\n" +
                            "আরবী উচ্চারণ: রাব্বানা ওয়ালা তুহাম্মিলনা মা লা তক্বাতা লানা বিহি ওয়াফু আন্না ওয়াঘফির লানা ওয়াইরহামনা আন্তা মাওলানা ফানসুরনা 'আলাল-ক্বাওমিল-কাফিরিন।\n" +
                            "\n" +
                            "বাংলা অর্থ: হে আমাদের প্রতিপালক! যে বোঝা বহন করার সামর্থ আমাদের নেই, তা আমাদের ওপর চাপিয়ে দিয়ো না। আমাদের প্রতি কোমল হও, আমাদের অপরাধ ক্ষমা করো এবং আমাদের প্রতি করুণা করো। তুমি আমাদের অভিভাবক। কাফেরদের মোকাবিলায় তুমি আমাদের সাহায্য করো। (বাকারাহ: ২৮৬)",
                    "৯। رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا\n" +
                            "\n" +
                            "আরবী উচ্চারণ: রাব্বানা লা তুয়াখিজনা ইন্নাসিনা আও আখতানা।\n" +
                            "\n" +
                            "বাংলা অর্থ: হে আমাদের রব! ভুল-ভ্রান্তিতে আমরা যেসব গোনাহ করে বসি, তুমি সেগুলো পাকড়াও করো না। (বাকারাহ: ২৮৬)",
                    "১০। رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ\n" +
                            "\n" +
                            "আরবী উচ্চারণ: রাব্বানা আফরিঘ আলাইনা সাব-রান ওয়া সাব্বিত আকদামানা ওয়ানসুরনা আলাল-কাউমিল-কাফিরিন\n" +
                            "\n" +
                            "বাংলা অর্থ: হে আমাদের রব! আমাদের সবর দান করো, আমাদের অবিচলিত রাখ এবং এই কাফের দলের ওপর আমাদের বিজয় দান করো। (বাকারাহ:২৫০)",
                    "১১। رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\n" +
                            "\n" +
                            "আরবী উচ্চারণ: রাব্বানা আতিনা ফিদ্দুনিয়া হাসানাতাও ওয়াফিল আখিরাতি হাসানাতাও ওয়াকিনা আযাবান্নার\n" +
                            "\n" +
                            "বাংলা অর্থ: হে আমাদের প্রভু প্রতিপালক! আমাদেরকে দুনিয়া ও আখিরাতের সর্বোত্তম কল্যাণ দান করো এবং আগুনের আযাব হতে আমাদের রক্ষা করো।(বাকারাহ:২০১)",
                    "প্রত্যেক দোয়া এর পূর্বে দরূদ শরীফ পাঠ না করলে সেই দোয়া আসমান ও জমিন এর মাঝে ঝুলতে থাকে"));

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_duya);

        RecyclerView RV=(RecyclerView) findViewById(R.id.recyclerViewId);
        RV.setLayoutManager(new LinearLayoutManager(this));

        DuyaAdapter adapt= new DuyaAdapter(this,DuyaNames);
        RV.setAdapter(adapt);
    }
}