package com.example.shohihadis;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;
import android.util.Log;

import java.util.ArrayList;
import java.util.Arrays;

public class TajbihActivity extends AppCompatActivity {

    ArrayList<String> TajbihName= new ArrayList<>(Arrays.asList("\uD83C\uDF39চারটি ছোট বাক্যের ফজিলত\uD83C\uDF39\n" +
            "\n" +
            "\n" +
            "★১. হযরত সামুরা ইবনু জুনদুব (রাঃ) বলেন,রাসূলুল্লাহ ﷺ বলেছেন,আল্লাহর নিকট সবচেয়ে প্রিয় বাক্য চারটিঃ সুবহানআল্লাহ,আলহামদুলিল্লাহ,লা-ইলাহা ইল্লাল্লাহ এবং আল্লাহু আকবর। তুমি ইচ্ছামতো এই বাক্য চারটির যে কোন বাক্য আগে পিছে বলতে পারো।(বাক্যগুলির সাজানোর ক্ষেত্রে কোন নিয়ম বা ফযিলত নেই )\n" +
            "[সহীহ মুসলিম ৩/১৬৮৫, নং ২১৩৭]\n" +
            "\n" +
            "★২. আবু হুরাইরা (রাঃ) বলেন,রাসূলুল্লাহ ﷺ বলেছেন,আঁমি সুবহানআল্লাহ, আলহামদুলিল্লাহ,লা-ইলাহা ইল্লাল্লাহ এবং আল্লাহু আকবর বলতে এত বেশি পছন্দ করি যে,এগুলি বলা আঁমার কাছে পৃথিবীর বুকে সূর্যের নীচে যা কিছু আছে সবকিছু থেকে বেশি প্রিয়।\n" +
            "[সহীহ মুসলিম ৪/২০৭২,নং ২৬৯৫]\n" +
            "\n" +
            "★৩. “সর্বশ্রেষ্ঠ দো‘আ হল,\n" +
            "ﺍﻟْﺤَﻤْﺪُ ﻟِﻠَّﻪِ\n" +
            "(আলহামদু লিল্লাহ) “সকল প্রশংসা আল্লাহরই”।আর সর্বোত্তম যিকর হল,\n" +
            "ﻻَ ﺇِﻟَﻪَ ﺇِﻻَّ ﺍﻟﻠَّﻪُ\n" +
            "(লা ইলাহা ইল্লাল্লাহ)“আল্লাহ ব্যতীত কোনো হক্ব ইলাহ নেই।”\n" +
            "\n" +
            "****দলিল*****\n" +
            "*(ক.) তিরমিযী ৫/৪৬২,নং ৩৩৮৩\n" +
            "*(খ.) ইবনে মাজাহ্ ২/১২৪৯, নং ৩৮০০ *(গ.) আল-হাকিম, ১/৫০৩ এবং সহীহ বলেছেন,আর ইমাম যাহাবী তা সমর্থন করেছেন।আরও দেখুন,সহীহুল জামে‘ ১/৩৬২।\n" +
            "\n" +
            "★৪. সুবহানাল্লাহ’ ও ‘আল্লাহু আকবার’ পৃথিবী ও আকাশ মণ্ডলী ভরে দেয়।\n" +
            "[সুনানে ইবনে মাজাহ: ২৮০]\n" +
            "\n" +
            "\uD83C\uDF39‘আলহামদুলিল্লাহ’র জিকির মিজানের পাল্লাকে ভারী করে দেয় এবং এটা সর্বোত্তম দোয়া।\n" +
            "[তিরমিজি: ৫/৪৬২ ও ইবনে মাজাহ: ২/১২৪৯]\n" +
            "\n" +
            "★৫. রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেনঃ তাসবীহ (সুবহানআল্লাহ),তাহলীল (লা ইলাহা ইল্লাল্লাহ),তাহমীদ (আলহামদুলিল্লাহ)-এর মাধ্যমে তোমার আল্লাহর যে মহিমা বর্ণনা কর তা মৌমাছির গুঞ্জনের শব্দ করে আরশের চার পাশে ঘুরতে থাকে।সেগুলো নিজ নিজ প্রেরকের কথা উল্ল্যেখ করতে থাকে।তোমাদের কেউ কি এটা পছন্দ কর না যে,আল্লাহর নিকট অনবরত উল্লেখকারী কেউ থাকুক?\n" +
            "\n" +
            "[সুনানে ইবনে মাজাহ: ৩৮০৯]\n" +
            "\n" +
            "★৬. উম্মু হানী (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম-এঁর নিকট এসে বললেনঃ হে রাসূলুল্লাহ! আমাকে এমন একটা আমল বলে দিন।কেননা আমি এখন বৃদ্ধ হয়ে পরেছি,দুর্বল হয়ে গেছি এবং আমার দেহও ভারী হয়ে গেছে।\n" +
            "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেনঃ তুমি শতবার ‘আল্লাহু আকবার’ শতবার ‘আলহামদুলিল্লাহ’ ও শতবার ‘সুবহানাল্লাহ’ পড়ো।তা জিনপোষ ও লাগামসহ একশ ঘোড়া আল্লাহর পথে (জিহাদে) দান করার চেয়ে উত্তম, একশ উটের চেয়ে উত্তম এবং একশ গোলাম আজাদ করার চেয়ে উত্তম।\n" +
            "\n" +
            "[সুনানে ইবনে মাজাহ: ৩৮১০]\n" +
            "\n" +
            "★৭. হাদিস শরীফে ইরশাদ হয়েছে\n" +
            "\n" +
            "وَعَنْ أَبي مَالِكٍ الأَشعَرِي رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم صلى الله عليه وسلم : «الطُّهُورُ شَطْرُ الإِيمانِ، وَالحَمْدُ للهِ تَمْلأُ المِيزَانَ، وَسُبْحَانَ اللهِ وَالحَمْدُ للهِ تَمْلآنِ – أَوْ تَمْلأُ – مَا بَيْنَ السَّمَاوَاتِ وَالأرْضِ». رواه مسلم\n" +
            "আবূ মালেক আশআরী (রাঃ) থেকে বর্ণিত।তিনি বলেন রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন,“পবিত্রতা অর্ধেক ঈমান।আর ‘আলহামদু লিল্লাহ’\n" +
            "(কিয়ামতে নেকীর) দাঁড়িপাল্লাকে ভরে দেবে এবং ‘সুবহানাল্লাহ’ ও ‘আলহামদু লিল্লাহ’ আসমান ও যমীনের মধ্যস্থিত শূন্যতা পূর্ণ করে দেয়।”\n" +
            "\n" +
            "****দলিল****\n" +
            "*(ক.) মুসলিম: ২২৩\n" +
            "*(খ.) তিরমিযী: ৩৫১৭\n" +
            "*(গ.) ইবনু মাজাহ: ২৮০\n" +
            "*(ঘ.) আহমাদ: ২৩৯৫,২২৪০১\n" +
            "*(ঙ.) দারেমী: ৬৫৩\n" +
            "\n" +
            "★৮. আবু হুরাইরা (রাঃ) বলেন,রাসূলুল্লাহ ﷺ বলেছেন,তোমরা যখন জান্নাতের বাগান সমূহে যাবে বা তা অতিক্রম করবে তখন তৃপ্তির সাথে বিচরণ ও ভক্ষন করবে।আমি বললামঃ হে আল্লাহর রাসূল, জান্নাতের বাগান সমূহ কি? তিঁনি বললেনঃ মসজিদসমূহ।আমি বললামঃ বিচরণ ও ভক্ষন কি? তিনি বললেনঃ সুবহানআল্লাহ,আলহামদুলিল্লাহ,লা-ইলাহা ইল্লাল্লাহ ও আল্লাহু আকবার।\n" +
            "[সুনানুত তিরমিযী ৫/৫৩২, নং ৩৫০৯]\n" +
            "\n" +
            "\uD83C\uDF39এছাড়াও ইবনে মাসউদ (রা:),সালমান ফারসী (রা:),আবু হুরাইরা (রা:) ও ইবনে আব্বাস (রাঃ) বর্নীত বিভিন্ন হাদীসে রাসূলুল্লাহ ﷺ বলেছেন যে এ বাক্য চারটির প্রতিটি বাক্য একবার বললে জান্নাতে একটি করে বৃক্ষ রোপন করা হয়।\n" +
            "[ইমাম মুনযিরী,আত-তারগীব ২/৪০৭-৪০৮, মাযমাউয যাওয়াইদ ১০/৮৮-৯০]\n" +
            "\n" +
            "★৯. আবু যার ও আয়েশা (রাঃ) বর্নীত বিভিন্ন হাদীসে রাসূলুল্লাহ ﷺ বলেছেনঃ এই বাক্যগুলির প্রত্যেক বাক্য একবার যিকর করা একবার আল্লাহর ওয়াস্তে দান করার সমতুল্য।\n" +
            "[সহীহ মুসলিম ১/৪৯৮ নং ৭২০; ২/৬৯৭ নং ১০০৬]\n" +
            "\n" +
            "★১০. আবু সালমা (রাঃ) থেকে বর্নীত হাদীসে রাসূলুল্লাহ ﷺ বলেছেনঃ এই বাক্যগুলি কিয়ামতের দিন বান্দার আমল নামায় সবচেয়ে বেশি ভারী হবে।\n" +
            "****দলিল*****\n" +
            "*(ক.) নাসাঈ, আস-সুনানুল কুবরা ৬/৫০ *(খ.) মুসনাদ আহমদ ৩/৪৪৩, ৪/২৩৭, ৫/৩৬৫\n" +
            "*(গ.) তাবারানী,আল মুজামুল কাবীর ২২/ ৩৪৮\n" +
            "*(ঘ.) মাযমাউয যাওয়াইদ ১/৪৯,১০/৮৮\n" +
            "\n" +
            "★১১. হযরত আনাস (রা:) বর্নীত হাদীসে রাসূলুল্লাহ ﷺ বলেছেনঃ গাছের ঢালে ঝাঁকি দিলে যেমন পাতাগুলি ঝরে যায় অনুরুপভাবে এই যিকরগুলি বললে বান্দার গুনাহ ঝরে যায়।\n" +
            "[মুসনাদ আহমদ ৩/১৫২,আত তারগীব ২/৪১৮]\n" +
            "\n" +
            "★১২. আবু হুরাইরা (রাঃ) ও আবু সাঈদ (রাঃ) উভয়ে নবীয়ে আকরাম ﷺ থেকে বর্ননা করেছেন,“আল্লাহ এই চারটি বাক্যকে বেছে পছন্দ করে নিয়েছেন। এই বাক্যগুলির যে কোন একটি বাক্য একবার বললে আল্লাহ ২০ টি সওয়াব প্রদান করতেন এবং ২০টি গুনাহ ক্ষমা করবেন। আর এভাবে যে বেশি বেশি যিকর করবে সে মুনাফিকী থেকে মুক্তি লাভ করবে”।\n" +
            "[নাসাঈ,আস-সুনানুল কুবরা ৬/২১০]\n" +
            "\n" +
            "★১৩. আবদুল্লাহ ইবনে উমার বর্নীত হাদীসে রাসূলুল্লাহ ﷺ বলেছেনঃ এই চারটি বাক্য যিকরকারী প্রতিটি বাক্যের প্রতিটি অক্ষরের জন্য ১০টি করে সাওয়াব লাভ করবেন।\n" +
            "[তাবারানী,আল-মুজমুল আউসাত ৬/৩০৯]\n" +
            "\n" +
            "★১৪. হযরত ফাতিমা (রাঃ) নিজের হাতে যাঁতা ঘুরিয়ে ও সংসারের সকল কর্ম একা করতে কষ্ট পেতেন।হযরত আলী (রাঃ) তাঁকে পরামর্শ দেন যে, তোমার আব্বার নিকট যুদ্ধলব্ধ একটি দাসী চাও, যে তোমাকে সংসার কর্মে সাহায্য করবে। তিনি রাসূলুল্লাহ ﷺ এঁর সাথে দেখা করতে এসে তাঁকে না পেয়ে ফিরে যান। রাত্রে তাঁরা বিছানায় শুয়ে পড়লে রাসূলুল্লাহ ﷺ তাঁদের কাছে আসেন। তিনি বলেন,“আঁমার আসহাবে সুফফার দরিদ্র সাহাবীগনকে বাদ দিয়ে তোমাকে কোন দাসী দিতে পারব না।তবে দাসীর চেয়েও উত্তম বিষয় তোমাদেরকে শিখিয়ে দিচ্ছি।তোমরা যখন বিছানায় শুয়ে পড়বে তখন ৩৩ বার সুবহানআল্লাহ,৩৩ বার আলহামদুলিল্লাহ এবং ৩৪ বার আল্লাহু আকবর বলবে।\n" +
            "****দলিল******\n" +
            "*(ক.) সহীহ বুখারী ৩/১১৩৩, ৩/১৩৫৮, ৫/২০৫১, ৫/২৩২৯,নং- ২৯৪৫, ৩৫০২, ৫০৪৬, ৫৯৫৯\n" +
            "*(খ.) সহীহ মুসলিম ৪/২০৯১,নং ২৭২৭\n" +
            "\n" +
            "\uD83C\uDF39হাদিস শরীফে ইরশাদ হয়েছে\n" +
            "\n" +
            "سُبْحَانَ اللهِ، اَلْحَمْدُ ِللهِ، اَللهُ أَكْبَرُ، لآ إلهَ إلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ وَ هُوَ عَلَى كُلِّ شَيْئٍ قَدِيْرٌ-\n" +
            "\n" +
            "সুবহা-নাল্লা-হ (৩৩ বার)।আলহাম্দুলিল্লা-হ (৩৩ বার)। আল্লাহু-আকবার (৩৩ বার)। লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্দাহূ লা শারীকা লাহূ; লাহুল মুল্কু ওয়া লাহুল হাম্দু ওয়া হুয়া ‘আলা কুল্লে শাইয়িন ক্বাদীর (১ বার)। অথবা আল্লা-হু আকবার (৩৪ বার)।\n" +
            "অর্থ : পবিত্রতাময় আল্লাহ। যাবতীয় প্রশংসা আল্লাহর জন্য। আল্লাহ সবার চেয়ে বড়। নেই কোন উপাস্য একক আল্লাহ ব্যতীত; তাঁর কোন শরীক নেই। তাঁরই জন্য সমস্ত রাজত্ব ও তাঁরই জন্য যাবতীয় প্রশংসা। তিনি সকল কিছুর উপরে ক্ষমতাশালী।\n" +
            "\n" +
            "[মুসলিম, মিশকাত হা/৯৬৬, ৯৬৭, ‘ছালাত’ অধ্যায়-৪, ‘ছালাত পরবর্তী যিকর’ অনুচ্ছেদ-১৮]\n" +
            "\n" +
            "\uD83C\uDF39রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন, ‘যে ব্যক্তি প্রত্যেক ফরয ছালাতের পর উক্ত দো‘আ পাঠ করবে, তার সকল গোনাহ মাফ করা হবে। যদিও তা সাগরের ফেনা সমতুল্য হয়’।\n" +
            "[মুসলিম, মিশকাত হা/৯৬৭]\n" +
            "\n" +
            "\uD83C\uDF39অন্য বর্ণনায় এসেছে, তিনি আয়েশা ও ফাতেমা (রাঃ)-কে বলেন, তোমরা এ দো‘আটি প্রত্যেক ছালাতের শেষে এবং শয়নকালে পড়বে। এটাই তোমাদের জন্য একজন খাদেমের চাইতে উত্তম হবে’।\n" +
            "\n" +
            "[মুত্তাফাক্ব ‘আলাইহ, মুসলিম, মিশকাত হা/২৩৮৭-৮৮ ‘দো‘আ সমূহ’ অধ্যায়-৯, ‘সকালে, সন্ধ্যায় ও শয়নকালে কি দো‘আ পড়তে হয়’ অনুচ্ছেদ- ৬]\n" +
            "\n" +
            "\uD83C\uDF39হাদিস শরীফে আরও ইরশাদ হয়েছে\n" +
            "\n" +
            "وَعَنْ كَعْبِ بنِ عُجْرَةَ رضي الله عنه، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم، قَالَ: «مُعَقِّبَاتٌ لاَ يَخِيبُ قَائِلُهُنَّ ـ أَوْ فَاعِلُهُنَّ ـ دُبُرَ كُلِّ صَلاَةٍ مَكْتُوبَةٍ: ثَلاَثٌ وَثَلاَثُونَ تَسْبِيحَةً. وَثَلاَثٌ وثَلاَثُونَ تَحْمِيدَةً، وَأَرْبَعٌ وَثَلاَثُونَ تَكْبِيرَةً» . رواه مسلم\n" +
            "\n" +
            "কা‘ব ইবনে উজরাহ (রাঃ) থেকে বর্ণিত।\n" +
            "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন,“নামাযান্তে কিছু বাক্য রয়েছে বা কিছু কর্ম রয়েছে,সেগুলি যে পড়বে বা (পাঠ) করবে, সে আদৌ ব্যর্থ হবে না। তা হচ্ছে প্রত্যেক ফরয নামায বাদ ৩৩ বার সুবহানাল্লাহ, ৩৩ বার আলহামদুলিল্লাহ ও ৩৪ বার আল্লাহু আকবার পড়া।”\n" +
            "\n" +
            "*****দলিল*******\n" +
            "*(ক.) মুসলিম: ৫৯৬\n" +
            "*(খ.) তিরমিযী: ৩৪১২\n" +
            "*(গ.) নাসায়ী ১৩৪৯\n" +
            "\n" +
            "\uD83C\uDF39হাদিস শরীফে ইরশাদ হয়েছে\n" +
            "\n" +
            "وَعَنْ أَبِي هُرَيرَةَ رضي الله عنه: أَنَّ فُقَراءَ المُهَاجِرِينَ أَتَوْا رَسُولَ اللهِ صلى الله عليه وسلم، فَقَالُوا: ذَهَبَ أَهْلُ الدُّثورِ بِالدَّرَجَاتِ العُلَى، وَالنَّعِيمِ المُقِيمِ، يُصَلُّونَ كَمَا نُصَلِّي، وَيَصُومُونَ كَمَا نَصُومُ، وَلَهُمْ فَضْلٌ مِنْ أَمْوَالٍ، يَحُجُّونَ، وَيَعْتَمِرُونَ، وَيُجَاهِدُونَ، وَيَتَصَدَّقُونَ . فَقَالَ: «أَلاَ أُعَلِّمُكُمْ شَيْئاً تُدْرِكُونَ بِهِ مَنْ سَبَقَكُمْ، وَتَسْبِقُونَ بِهِ مَنْ بَعْدَكُمْ، وَلاَ يَكُونُ أَحَدٌ أَفْضَلَ مِنْكُمْ إِلاَّ مَنْ صَنَعَ مِثْلَ مَا صَنَعْتُمْ؟» قَالُوا: بَلَى يَا رَسُولَ اللهِ صلى الله عليه وسلم، قَالَ: تُسَبِّحُونَ، وَتَحْمَدُونَ، وَتُكَبِّرُونَ، خَلْفَ كُلِّ صَلاَةٍ ثَلاثاً وَثَلاثِينَ». قَالَ أَبُو صَالِحٍ الرَّاوِي عَن أَبِي هُرَيرَةَ رضي الله عنه، لَمَّا سُئِلَ عَنْ كَيْفِيَّةِ ذِكْرِهِنَّ قَالَ: يَقُول: سُبْحَان اللهِ، وَالحَمْدُ للهِ، واللهُ أكْبَرُ، حَتَّى يَكُونَ مِنهُنَّ كُلُّهُنَّ ثَلاثاً وَثَلاثِينَ. متفقٌ عَلَيْهِ\n" +
            "\n" +
            "وَزَادَ مُسلِمٌ فِي رِوَايَتِهِ: فَرَجَعَ فُقَرَاءُ المُهَاجِرِينَ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالُوا: سَمِعَ إِخْوَانُنَا أَهْلُ الأَمْوَالِ بِمَا فَعَلْنَا فَفَعَلُوا مِثْلَهُ ؟ فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم صلى الله عليه وسلم : ذَلِكَ فَضْلُ الله يُؤتِيهِ مَنْ يَشَاءُ\n" +
            "আবূ হুরাইরা (রাঃ) থেকে বর্ণিত।একদা গরীব মুহাজির (সাহাবাগণ) রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম)-এঁর নিকট এসে বললেন, ‘হে আল্লাহর রসূল! ধনীরাই তো উঁচু উঁচু মর্যাদা ও চিরস্থায়ী সম্পদের অধিকারী হয়ে গেল।তারা নামায পড়ছে,যেমন আমরা নামায পড়ছি,তারা রোযা রাখছে,যেমন আমরা রাখছি। কিন্তু তাদের উদ্বৃত্ত মাল আছে, ফলে তারা হজ্জ করছে, উমরাহ করছে, জিহাদ করছে ও সাদকাহ করছে, (আর আমরা করতে পারছি না)।’এ কথা শুনে তিনি বললেন, “আঁমি কি তোমাদেরকে এমন জিনিস শিখিয়ে দেব না, যার দ্বারা তোমরা তোমাদের অগ্রবর্তীদের মর্যাদা লাভ করবে,তোমাদের পরবর্তীদের থেকে অগ্রবর্তী থাকবে এবং তোমাদের মত কাজ যে করবে,সে ছাড়া অন্য কেউ তোমাদের চাইতে শ্রেষ্ঠতর হতে পারবে না?” তাঁরা বললেন, ‘অবশ্যই হে আল্লাহর রসূল! (আমাদেরকে তা শিখিয়ে দিন।)’ তিনি বললেন, “প্রত্যেক (ফরয) নামাযের পরে ৩৩ বার তাসবীহ, তাহমীদ ও তাকবীর পাঠ করবে।”\n" +
            "\n" +
            "আবূ হুরাইরা (রাঃ) থেকে বর্ণনাকারী আবূ সালেহ বলেন, ‘কিভাবে পাঠ করতে হবে, তা জিজ্ঞাসা করা হলে তিনি বললেন, ‘সুবহানাল্লাহ’, ‘আল্লাহু আকবার’ ও ‘আল-হামদু লিল্লাহ’ বলবে। যেন প্রত্যেকটি বাক্য ৩৩ বার করে হয়।\n" +
            "\n" +
            "****দলিল*****\n" +
            "*(ক.) সহীহুল বুখারী: ৮৪৩\n" +
            "*(খ.) মুসলিম: ৫৯৫\n" +
            "*(গ.) আবূ দাউদ: ১৫০৪\n" +
            "*(ঘ.) আহমাদ: ৭২০২\n" +
            "*(ঙ.) দারেমী: ১৩৫৩\n" +
            "\n" +
            "\uD83C\uDF39মুসলিমের বর্ণনায় এ কথা বাড়তি আছে যে, অতঃপর গরীব মুহাজিরগণ পুনরায় আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এঁর নিকট এসে বললেন, ‘আমরা যে আমল করছি, সে আমল আমাদের ধনী ভাইয়েরা শোনার পর তারাও আমল শুরু করে দিয়েছে? (এখন তো তারা আবার আমাদের চেয়ে অগ্রবর্তী হয়ে যাবে।)’ আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, “এ হল আল্লাহর অনুগ্রহ; তিনি যাকে ইচ্ছা তা দান করেন।”\n" +
            "[হাদিসের মানঃ সহিহ হাদিস]\n" +
            "\n" +
            "\uD83C\uDF39হাদিস শরীফে আরও ইরশাদ হয়েছে\n" +
            "\n" +
            "وَعَنْه، عَن رَسُولِ اللهِ صلى الله عليه وسلم، قَالَ: «مَنْ سَبَّحَ اللهَ فِي دُبُرِ كُلِّ صَلاَةٍ ثَلاَثاً وَثَلاَثِينَ، وحَمِدَ اللهَ ثَلاثاً وَثَلاَثِينَ، وَكَبَّرَ الله ثَلاَثاً وَثَلاَثِينَ، وَقَالَ تَمَامَ المِئَةِ: لاَ إِلٰهَ إِلاَّ اللهُ وَحدَهُ لاَ شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، غُفِرَتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ البَحْرِ». رواه مسلم\n" +
            "\n" +
            "উক্ত রাবী (রাঃ) থেকে বর্ণিত।রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, “যে ব্যক্তি প্রত্যেক (ফরয) নামায বাদ ৩৩ বার সুবহানাল্লাহ, ৩৩ বার আলহামদু লিল্লাহ ও ৩৩ বার আল্লাহু আকবার এবং একশত পূর্ণ করতে ‘লা-ইলা-হা ইল্লাল্লাহু অহদাহু লা শারীকালাহু লাহুল মুলকু অলাহুল হামদু অহুয়া আলা কুল্লি শায়ইন ক্বাদীর’ পড়বে, তার গুনাহসমূহ মাফ করে দেওয়া হবে; যদিও তা সমুদ্রের ফেনার সমান হয়।\n" +
            "\n" +
            "****দলিল****\n" +
            "*(ক.) মুসলিম: ৫৯৭\n" +
            "*(খ.) আবূ দাউদ: ১৫০৪\n" +
            "*(গ.) আহমাদ: ৮৬১৬,৯৮৯৭\n" +
            "*(ঘ.) মুওয়াত্তা মালিক: ৮৪৪\n" +
            "\n" +
            "★১৫. হযরত আবদুল্লাহ ইবনে আমর (রা) বলেন,রাসূলুল্লাহ ﷺ বলেছেন,কোন মুসলিম যদি দু’টি কাজ নিয়মিত করতে পারে তাহলে সে জান্নাতে প্রবেশ করবে। কাজ দু’টি খুবই সহজ কিন্তু করার মানুষ খুব কম। প্রথমত, প্রত্যেক সালাতের পরে ১০ বার সুবহানআল্লাহ,১০বার আলহামদুলিল্লাহ ও ১০ বার আল্লাহু আকবর বলবে। এতে ১৫০ বার জিহবার যিকর হবে এবং আল্লাহর কাছে আমলনামায় বা মীযানে ১৫০০ সাওয়াব হবে।দ্বিতীয়ত, বিছানায় শয়ন করার পরে ৩৪ বার আল্লাহু আকবর,৩৩ বার আল-হামদুলিল্লাহ ও ৩৩ বার সুবহানআল্লাহ বলবে। এতে মুখে ১০০বার ও মীযানে ১০০০ বার হবে”।রাসূলুল্লাহ ﷺ আংগুলে গুনে গুনে তা দেখান।সাহাবীগন প্রশ্ন করেনঃ “এই দুটি কর্ম সহজ হওয়া সত্ত্বেও পালনকারী কম কেন? তিঁনি উত্তরে বলেনঃ “কেউ শুয়ে পড়লে শয়তান এসে এগুলি বলার আগেই ঘুম পাড়িয়ে দেয়। সালাতের পরে এগুলি বলার আগেই তাকে তার বিভিন্ন কথা মনে করিয়ে দেয়।\n" +
            "\n" +
            "[সুনানু আবু দাউদ ৪/৩১৬,নং ৫০৬৫]\n" +
            "\n" +
            "★১৬. হাদিস শরীফে ইরশাদ হয়েছে\n" +
            "\n" +
            "وَعَنْ جَابِرٍ رضي الله عنه قَالَ: سَمِعتُ رَسُولَ اللهِ صلى الله عليه وسلم صلى الله عليه وسلم، يَقُولُ: «أَفْضَلُ الذِّكْرِ: لاَ إِلٰهَ إِلاَّ اللهُ» . رواه الترمذي، وقال: حديث حسن\n" +
            "\n" +
            "জাবের (রাঃ) থেকে বর্ণিত।তিনি বলেন, আমি আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম কে বলতে শুনেছি যে, সর্বশ্রেষ্ঠ যিক্\u200Cর হচ্ছে ‘‘লা ইলাহা ইল্লাল্লাহ।”\n" +
            "\n" +
            "[তিরমিযী:৩৩৮৩,ইবনু মাজাহ: ৩৮০০]\n" +
            "হাদিসের মানঃ হাসান হাদিস\n" +
            "\n" +
            "★১৭. হাদিস শরীফে ইরশাদ হয়েছে\n" +
            "\n" +
            "وَعَنْ سَعدِ بنِ أَبي وَقَّاصٍ رضي الله عنه قَالَ: كُنَّا عِنْدَ رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَ: «أَيَعجِزُ أَحَدُكُمْ أَنْ يَكْسِبَ فِي كُلِّ يَومٍ أَلْفَ حَسَنَةٍ !» فَسَأَلَهُ سَائِلٌ مِنْ جُلَسائِهِ: كَيْفَ يَكْسِبُ أَلفَ حَسَنَةٍ ؟ قَالَ: «يُسَبِّحُ مِئَةَ تَسْبِيحَةٍ فَيُكْتَبُ لَهُ أَلْفُ حَسَنَةٍ، أَوْ يُحَطُّ عَنْهُ أَلفُ خَطِيئَةٍ» . رواه مسلم\n" +
            "\n" +
            "সা’দ ইবনে আবূ অক্কাস (রাঃ) থেকে বর্ণিত।তিনি বলেন,আমরা আল্লাহর রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এঁর নিকট উপস্থিত ছিলাম।তিনি বললেন, “তোমাদের কোন ব্যক্তি প্রত্যহ এক হাজার নেকী অর্জন করতে অপারগ হবে কি?” তাঁর সাথে উপবিষ্ট ব্যক্তিদের একজন জিজ্ঞাসা করল,‘কিভাবে এক হাজার নেকী অর্জন করবে?’ তিঁনি বললেন, “একশ’বার তাসবীহ (সুবহানাল্লাহ) পড়বে। ফলে তার জন্য এক হাজার নেকী লেখা হবে অথবা এক হাজার গুনাহ মিটিয়ে দেওয়া হবে।”\n" +
            "\n" +
            "****দলিল******\n" +
            "*(ক.) মুসলিম: ২৬৯৮\n" +
            "*(খ.) তিরমিযী: ৩৪৬৩\n" +
            "*(গ.) আহমাদ: ১৪৯৯,১৫৬৬,১৬১৫\n" +
            "\n" +
            "\uD83C\uDF39হুমাইদী বলেন,মুসলিম গ্রন্থে এ রকম يُحَطُّ أَوْ (অথবা–মিটিয়ে দেওয়া হবে) এসেছে। বারক্বানী বলেন,এটিকে শু’বাহ, আবূ আওয়ানাহ ও ইয়াহয়্যা আলক্বাত্তান সেই মূসা হতে বর্ণনা করেছেন,যাঁর সূত্রে ইমাম মুসলিম বর্ণনা করেছেন।এঁরা বলেছেন, وَيُحَطُّ (এবং— মিটিয়ে দেওয়া হবে।) অর্থাৎ, তাতে ‘ওয়াও’-এর পূর্বে ‘আলিফ’ বর্ণ নেই। (আর তার মানে হল, তার জন্য এক হাজার নেকী লেখা হবে এবং এক হাজার গুনাহও মিটিয়ে দেওয়া হবে।)\n" +
            "[হাদিসের মানঃ সহিহ হাদিস]"));

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_tajbih);

        RecyclerView RV=(RecyclerView) findViewById(R.id.recyclerViewId);
        RV.setLayoutManager(new LinearLayoutManager(this));

        TajbihAdapter adapt= new TajbihAdapter(this,TajbihName);
        RV.setAdapter(adapt);
    }
}